/**Робота із запитами на сервер – це дуже важлива частина вивчення js. Вся робота з api запитами - це асинхронний код і дуже важливо розуміти як він працює на відміну від синхронного.
Для запитів на сервер можна використовувати fetch це дефолтний метод js який дозволяє легко та логічно отримувати ресурси через мережу асинхронно.
Так само є бібліотеки за допомогою яких можна дуже зручно працювати з запитами, наведу одну з таких в додаткових матеріалах внизу.
AJAX (Asynchronous Javascript And Xml) - технологія звернення до сервера без перезавантаження сторінки. За рахунок цього зменшується час відгуку та веб-додаток з інтерактивності більше нагадує desktop.
Незважаючи на те, що в назві технології є буква X (від слова XML), використовувати XML зовсім не обов’язково. Під AJAX мають на увазі будь-яке спілкування з сервером без перезавантаження сторінки, організоване за допомогою JavaScript.
Додаткові матеріали:
Fetch - https://developer.mozilla.org/en-US/docs/Web/API/Fetch_API/Using_Fetch
Бібліотека для роботи із запитами Axios - https://github.com/axios/axios */